s = '''
🇦🇨Флаг: о-в Вознесения
🇦🇩Флаг: Андорра
🇦🇪Флаг: ОАЭ
🇦🇫Флаг: Афганистан
🇦🇬Флаг: Антигуа и Барбуда
🇦🇮Флаг: Ангилья
🇦🇱Флаг: Албания
🇦🇲Флаг: Армения
🇦🇴Флаг: Ангола
🇦🇶Флаг: Антарктида
🇦🇷Флаг: Аргентина
🇦🇸Флаг: Американское Самоа
🇦🇹Флаг: Австрия
🇦🇺Флаг: Австралия
🇦🇼Флаг: Аруба
🇦🇽Флаг: Аландские о-ва
🇦🇿Флаг: Азербайджан
🇧🇦Флаг: Босния и Герцеговина
🇧🇧Флаг: Барбадос
🇧🇩Флаг: Бангладеш
🇧🇪Флаг: Бельгия
🇧🇫Флаг: Буркина-Фасо
🇧🇬Флаг: Болгария
🇧🇭Флаг: Бахрейн
🇧🇮Флаг: Бурунди
🇧🇯Флаг: Бенин
🇧🇱Флаг: Сен-Бартелеми
🇧🇲Флаг: Бермудские о-ва
🇧🇳Флаг: Бруней
🇧🇴Флаг: Боливия
🇧🇶Флаг: Бонэйр, Синт-Эстатиус и Саба
🇧🇷Флаг: Бразилия
🇧🇸Флаг: Багамы
🇧🇹Флаг: Бутан
🇧🇻Флаг: о-в Буве
🇧🇼Флаг: Ботсвана
🇧🇾Флаг: Беларусь
🇧🇿Флаг: Белиз
🇨🇦Флаг: Канада
🇨🇨Флаг: Кокосовые о-ва
🇨🇩Флаг: Конго - Киншаса
🇨🇫Флаг: Центрально-Африканская Республика
🇨🇬Флаг: Конго - Браззавиль
🇨🇭Флаг: Швейцария
🇨🇮Флаг: Кот-д’Ивуар
🇨🇰Флаг: Острова Кука
🇨🇱Флаг: Чили
🇨🇲Флаг: Камерун
🇨🇳Флаг: Китай
🇨🇴Флаг: Колумбия
🇨🇵Флаг: о-в Клиппертон
🇨🇷Флаг: Коста-Рика
🇨🇺Флаг: Куба
🇨🇻Флаг: Кабо-Верде
🇨🇼Флаг: Кюрасао
🇨🇽Флаг: о-в Рождества
🇨🇾Флаг: Кипр
🇨🇿Флаг: Чехия
🇩🇪Флаг: Германия
🇩🇬Флаг: Диего-Гарсия
🇩🇯Флаг: Джибути
🇩🇰Флаг: Дания
🇩🇲Флаг: Доминика
🇩🇴Флаг: Доминиканская Республика
🇩🇿Флаг: Алжир
🇪🇦Флаг: Сеута и Мелилья
🇪🇨Флаг: Эквадор
🇪🇪Флаг: Эстония
🇪🇬Флаг: Египет
🇪🇭Флаг: Западная Сахара
🇪🇷Флаг: Эритрея
🇪🇸Флаг: Испания
🇪🇹Флаг: Эфиопия
🇪🇺Флаг: Европейский союз
🇫🇮Флаг: Финляндия
🇫🇯Флаг: Фиджи
🇫🇰Флаг: Фолклендские о-ва
🇫🇲Флаг: Федеративные Штаты Микронезии
🇫🇴Флаг: Фарерские о-ва
🇫🇷Флаг: Франция
🇬🇦Флаг: Габон
🇬🇧Флаг: Великобритания
🇬🇩Флаг: Гренада
🇬🇪Флаг: Грузия
🇬🇫Флаг: Французская Гвиана
🇬🇬Флаг: Гернси
🇬🇭Флаг: Гана
🇬🇮Флаг: Гибралтар
🇬🇱Флаг: Гренландия
🇬🇲Флаг: Гамбия
🇬🇳Флаг: Гвинея
🇬🇵Флаг: Гваделупа
🇬🇶Флаг: Экваториальная Гвинея
🇬🇷Флаг: Греция
🇬🇸Флаг: Южная Георгия и Южные Сандвичевы о-ва
🇬🇹Флаг: Гватемала
🇬🇺Флаг: Гуам
🇬🇼Флаг: Гвинея-Бисау
🇬🇾Флаг: Гайана
🇭🇰Флаг: Гонконг (САР)
🇭🇲Флаг: о-ва Херд и Макдональд
🇭🇳Флаг: Гондурас
🇭🇷Флаг: Хорватия
🇭🇹Флаг: Гаити
🇭🇺Флаг: Венгрия
🇮🇨Флаг: Канарские о-ва
🇮🇩Флаг: Индонезия
🇮🇪Флаг: Ирландия
🇮🇱Флаг: Израиль
🇮🇲Флаг: о-в Мэн
🇮🇳Флаг: Индия
🇮🇴Флаг: Британская территория в Индийском океане
🇮🇶Флаг: Ирак
🇮🇷Флаг: Иран
🇮🇸Флаг: Исландия
🇮🇹Флаг: Италия
🇯🇪Флаг: Джерси
🇯🇲Флаг: Ямайка
🇯🇴Флаг: Иордания
🇯🇵Флаг: Япония
🇰🇪Флаг: Кения
🇰🇬Флаг: Киргизия
🇰🇭Флаг: Камбоджа
🇰🇮Флаг: Кирибати
🇰🇲Флаг: Коморы
🇰🇳Флаг: Сент-Китс и Невис
🇰🇵Флаг: КНДР
🇰🇷Флаг: Республика Корея
🇰🇼Флаг: Кувейт
🇰🇾Флаг: Острова Кайман
🇰🇿Флаг: Казахстан
🇱🇦Флаг: Лаос
🇱🇧Флаг: Ливан
🇱🇨Флаг: Сент-Люсия
🇱🇮Флаг: Лихтенштейн
🇱🇰Флаг: Шри-Ланка
🇱🇷Флаг: Либерия
🇱🇸Флаг: Лесото
🇱🇹Флаг: Литва
🇱🇺Флаг: Люксембург
🇱🇻Флаг: Латвия
🇱🇾Флаг: Ливия
🇲🇦Флаг: Марокко
🇲🇨Флаг: Монако
🇲🇩Флаг: Молдова
🇲🇪Флаг: Черногория
🇲🇫Флаг: Сен-Мартен
🇲🇬Флаг: Мадагаскар
🇲🇭Флаг: Маршалловы Острова
🇲🇰Флаг: Северная Македония
🇲🇱Флаг: Мали
🇲🇲Флаг: Мьянма (Бирма)
🇲🇳Флаг: Монголия
🇲🇴Флаг: Макао (САР)
🇲🇵Флаг: Северные Марианские о-ва
🇲🇶Флаг: Мартиника
🇲🇷Флаг: Мавритания
🇲🇸Флаг: Монтсеррат
🇲🇹Флаг: Мальта
🇲🇺Флаг: Маврикий
🇲🇻Флаг: Мальдивы
🇲🇼Флаг: Малави
🇲🇽Флаг: Мексика
🇲🇾Флаг: Малайзия
🇲🇿Флаг: Мозамбик
🇳🇦Флаг: Намибия
🇳🇨Флаг: Новая Каледония
🇳🇪Флаг: Нигер
🇳🇫Флаг: о-в Норфолк
🇳🇬Флаг: Нигерия
🇳🇮Флаг: Никарагуа
🇳🇱Флаг: Нидерланды
🇳🇴Флаг: Норвегия
🇳🇵Флаг: Непал
🇳🇷Флаг: Науру
🇳🇺Флаг: Ниуэ
🇳🇿Флаг: Новая Зеландия
🇴🇲Флаг: Оман
🇵🇦Флаг: Панама
🇵🇪Флаг: Перу
🇵🇫Флаг: Французская Полинезия
🇵🇬Флаг: Папуа — Новая Гвинея
🇵🇭Флаг: Филиппины
🇵🇰Флаг: Пакистан
🇵🇱Флаг: Польша
🇵🇲Флаг: Сен-Пьер и Микелон
🇵🇳Флаг: о-ва Питкэрн
🇵🇷Флаг: Пуэрто-Рико
🇵🇸Флаг: Палестинские территории
🇵🇹Флаг: Португалия
🇵🇼Флаг: Палау
🇵🇾Флаг: Парагвай
🇶🇦Флаг: Катар
🇷🇪Флаг: Реюньон
🇷🇴Флаг: Румыния
🇷🇸Флаг: Сербия
🇷🇺Флаг: Россия
🇷🇼Флаг: Руанда
🇸🇦Флаг: Саудовская Аравия
🇸🇧Флаг: Соломоновы Острова
🇸🇨Флаг: Сейшельские Острова
🇸🇩Флаг: Судан
🇸🇪Флаг: Швеция
🇸🇬Флаг: Сингапур
🇸🇭Флаг: о-в Св. Елены
🇸🇮Флаг: Словения
🇸🇯Флаг: Шпицберген и Ян-Майен
🇸🇰Флаг: Словакия
🇸🇱Флаг: Сьерра-Леоне
🇸🇲Флаг: Сан-Марино
🇸🇳Флаг: Сенегал
🇸🇴Флаг: Сомали
🇸🇷Флаг: Суринам
🇸🇸Флаг: Южный Судан
🇸🇹Флаг: Сан-Томе и Принсипи
🇸🇻Флаг: Сальвадор
🇸🇽Флаг: Синт-Мартен
🇸🇾Флаг: Сирия
🇸🇿Флаг: Эсватини
🇹🇦Флаг: Тристан-да-Кунья
🇹🇨Флаг: Тёркс и Кайкос
🇹🇩Флаг: Чад
🇹🇫Флаг: Французские Южные территории
🇹🇬Флаг: Того
🇹🇭Флаг: Таиланд
🇹🇯Флаг: Таджикистан
🇹🇰Флаг: Токелау
🇹🇱Флаг: Восточный Тимор
🇹🇲Флаг: Туркменистан
🇹🇳Флаг: Тунис
🇹🇴Флаг: Тонга
🇹🇷Флаг: Турция
🇹🇹Флаг: Тринидад и Тобаго
🇹🇻Флаг: Тувалу
🇹🇼Флаг: Тайвань
🇹🇿Флаг: Танзания
🇺🇦Флаг: Украина
🇺🇬Флаг: Уганда
🇺🇲Флаг: Внешние малые о-ва (США)
🇺🇳Флаг: Организация Объединенных Наций
🇺🇸Флаг: Соединенные Штаты
🇺🇾Флаг: Уругвай
🇺🇿Флаг: Узбекистан
🇻🇦Флаг: Ватикан
🇻🇨Флаг: Сент-Винсент и Гренадины
🇻🇪Флаг: Венесуэла
🇻🇬Флаг: Виргинские о-ва (Великобритания)
🇻🇮Флаг: Виргинские о-ва (США)
🇻🇳Флаг: Вьетнам
🇻🇺Флаг: Вануату
🇼🇫Флаг: Уоллис и Футуна
🇼🇸Флаг: Самоа
🇽🇰Флаг: Косово
🇾🇪Флаг: Йемен
🇾🇹Флаг: Майотта
🇿🇦Флаг: Южно-Африканская Республика
🇿🇲Флаг: Замбия
🇿🇼Флаг: Зимбабве
🏴󠁧󠁢󠁥󠁮󠁧󠁿Флаг: Англия
🏴󠁧󠁢󠁳󠁣󠁴󠁿Флаг: Шотландия
🏴󠁧󠁢󠁷󠁬󠁳󠁿Флаг: Уэльс
'''